app/controllers/articles_controller.rb

INSERT INTO "articles" ("title", "description", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["title", "blackhawk-marketplace"], ["description", "This feature is required for sendGrid migration"], ["created_at", "2020-11-03 09:28:08.724974"], ["updated_at", "2020-11-03 09:28:08.724974"]]
---
  def create
    @article = Article.new(set_params)
    # render plain: @article.inspect
    if @article.save

UPDATE "articles" SET "description" = ?, "updated_at" = ? WHERE "articles"."id" = ?  [["description", "edited-descrption of first article"], ["updated_at", "2020-11-03 09:07:01.039424"], ["id", 1]]
---
  def update
    # render plain: @article.inspect
    if @article.update(set_params)